# config.py

# 管理员的 Telegram user_id
ADMIN_USER_ID = 12345678

# 各种玩法赔率
odds = {
    '特码': 47,  # 特码赔率
    '特肖不带龙': 11.7,  # 特肖不带龙赔率
    '特肖带龙': 9.5,  # 特肖带龙赔率
    '平特一肖不带龙': [2.1, 4.5, 12.5, 36, 100],  # 平特一肖赔率
    '波色': {'红波': 2.75, '蓝波': 2.98, '绿波': 2.98},  # 波色赔率
    '五不中': 2,
    '六不中': 2.5,
    '七不中': 3,
    '八不中': 3.5,
    '九不中': 4,
    '十不中': 5
}

# 生肖与号码映射
zodiac_map = {
    '龙': [1, 13, 25, 37, 49],
    '兔': [2, 14, 26, 38],
    '虎': [3, 15, 27, 39],
    '牛': [4, 16, 28, 40],
    '鼠': [5, 17, 29, 41],
    '猪': [6, 18, 30, 42],
    '狗': [7, 19, 31, 43],
    '鸡': [8, 20, 32, 44],
    '猴': [9, 21, 33, 45],
    '羊': [10, 22, 34, 46],
    '马': [11, 23, 35, 47],
    '蛇': [12, 24, 36, 48]
}

